{
  "name": "contour data",
  "display": "contour data",
  "desc": "The contour_data module provides a means to color surface and volumetric objects in solid colored bands.",
  "categories": [
    {
      "name": "Properties",
      "display": "Properties",
      "properties": [
        {
          "name": "Switch Property View",
          "display": "Switch Property View",
          "desc": "Edit the renderable (red) port properties for the module."
        },
        {
          "name": "Max Edge Angle",
          "display": "Max Edge Angle",
          "desc": "The Max Edge Angle angle is defined as the angle between two faces or cells in the model."
        },
        {
          "name": "Contour By",
          "display": "Contour By",
          "desc": "The Contour By control selects the type of data to use in contouring"
        },
        {
          "name": "Prepend Contoured String",
          "display": "Prepend Contoured String",
          "desc": "The Prepend Contoured String toggle when selected will add the \"Countoured\" string to the output data component.  This allows the user to indicate the data has been altered across the band the by the module."
        },
        {
          "name": "Contour Component",
          "display": "Contour Component",
          "desc": "The Contour Component refers to the nodal data component that will be used to create the contours."
        },
        {
          "name": "Cell Contour Component",
          "display": "Cell Contour Component",
          "desc": "The Contour Component refers to the cell data component that will be used to create the contours."
        },
        {
          "name": "Band Data",
          "display": "Band Data",
          "desc": "Band Data assigns the color of the each contour using one of three options. Min of Band chooses the color (according to your Datamap) which would be determined by the minimum value of each band. Avg of Band chooses the color (according to your Datamap) which would be determined by the average value of each band. Max of Band chooses the color (according to your Datamap) which would be determined by the maximum value of each band."
        },
        {
          "name": "Contour Distribution",
          "display": "Contour Distribution",
          "desc": "The Contour Distribution allows the user to choose between automatically generating contour levels or setting them by hand."
        },
        {
          "name": "Logarithmic Decades",
          "display": "Logarithmic Decades",
          "desc": "When the data has been log processed the Logarithmic Decades determines the number of contours.  If the Log option is selected the Contours Per Log Decade value is used. If Unformatted is selected the Number Of Contours is used."
        },
        {
          "name": "Contours Per Log Decade",
          "display": "Contours Per Log Decade",
          "desc": "If the Log Option is Selected for Logarithmic Decades the increments per decade can be set with this value."
        },
        {
          "name": "Number Of Contours",
          "display": "Number Of Contours",
          "desc": "When the data is log processed the Number Of Contours refers to the number of contours per decade.  If the data is linear processed the number of contours refers to the total number of contours to be drawn."
        },
        {
          "name": "Minimum Contour Level",
          "display": "Minimum Contour Level",
          "desc": "The Minimum contour level displays the minimum value of the Contour Component."
        },
        {
          "name": "User Contour Levels",
          "display": "User Contour Levels",
          "desc": "The Contour Levels are user defined levels."
        },
        {
          "name": "Maximum Contour Level",
          "display": "Maximum Contour Level",
          "desc": "The Maximum contour level displays the maximum value of the Contour Component."
        }
      ]
    }
  ]
}