{
  "name": "explode and scale",
  "display": "explode and scale",
  "desc": "The Explode and Scale module is used to separate (or explode) and apply a scaling factor to the vertical dimension (z-coordinate) of cell sets in a model.",
  "categories": [
    {
      "name": "Properties",
      "display": "Properties",
      "properties": [
        {
          "name": "Vertical Offset",
          "display": "Vertical Offset",
          "desc": "Vertical Offset translates your entire model in Z by the value input multiplied by the Z Exaggeration.  This is useful if you want to move your model to avoid having coincident objects."
        }
      ]
    },
    {
      "name": "Explode And Scale Settings",
      "display": "Explode And Scale Settings",
      "properties": [
        {
          "name": "Explode By",
          "display": "Explode By",
          "desc": "The Explode By options determine what information is used to explode the layers or materials. Layer and Material are nodal data components that should be present with any hierarchical geologic model. The Cell Set option allows you to explode by the Cell Set number. The Lithology option is to be used only with Adaptive Indicator Kriged geologic models.  These models have a cell data component called Lithology which corresponds to integer values assigned to material regions."
        },
        {
          "name": "Explode Begins",
          "display": "Explode Begins",
          "desc": "Explode Begins determines the first layer or material that will be exploded."
        },
        {
          "name": "Explode Ends",
          "display": "Explode Ends",
          "desc": "Explode Ends sets the last layer/material which will be exploded.  This value defaults to -1 which will explode all remaining layers or materials."
        },
        {
          "name": "Cell Sets",
          "display": "Cell Sets",
          "desc": "The Cell Sets control allows selected cell sets to be turned off in the output."
        }
      ]
    }
  ]
}