{
  "name": "file tools",
  "display": "file tools",
  "desc": "This module takes a file and either refine or subset the data and create a new file.",
  "categories": [
    {
      "name": "Properties",
      "display": "Properties",
      "properties": [
        {
          "name": "Component",
          "display": "Component",
          "desc": "The Component value selects which analyte to use when subsetting.  If -1 is chosen all analytes will be subset.  The number 0 will refer to the first analyte."
        },
        {
          "name": "File Process",
          "display": "File Process",
          "desc": "The File Process allows the user to select how to affect each file.  For the Refine option the module reads .pgf files and removes duplicate material values on the same boring so that materials are not over defined. If the topmost material in a Boring is not duplicated an additional sample will be added to the boring. For the subset option the module reads .apdv, aidv, or gmf files and creates or simplifies them by first deleting all the lines where the parameter data is -1.00E+09 (missing data). Then it keeps every nth (defined by the Subset Value) line of the file starting with the first line. This is very useful when you have an overly large data file that is causing the kriging to choose all points from the same local region."
        },
        {
          "name": "Add Missing Ground Surface",
          "display": "Add Missing Ground Surface",
          "desc": "The Add Missing Ground Surface toggle affects the refining process for pgf files.  If the pgf file does not have a duplicated material for the first two surfaces the module will create an artificial sample at the top of the boring with first material."
        },
        {
          "name": "Subset Value",
          "display": "Subset Value",
          "desc": "The Subset Value is used when Subsetting to define which line numbers are kept.  For example if the Subset Value is 4 then every 4th line will be kept."
        }
      ]
    }
  ]
}