{
  "name": "horizons to 3d structured",
  "display": "horizons to 3d structured",
  "desc": "Create 3-dimensional solid layers from the 2-dimensional surfaces produced by Krig_3D_Geology, to allow visualizations of the geologic layering of a system.",
  "categories": [
    {
      "name": "Properties",
      "display": "Properties",
      "properties": []
    },
    {
      "name": "Layer Settings",
      "display": "Layer Settings",
      "properties": [
        {
          "name": "Z Resolution",
          "display": "Z Resolution",
          "desc": "The Z Resolution is used as a guide for establishing the total number of cells in the model. The reason the term guide is used is due to the possibility that the module could potentially produce more than the total."
        },
        {
          "name": "Minimum Cells Per Layer",
          "display": "Minimum Cells Per Layer",
          "desc": "The Minimum Cells Per Layer control is used for establishing a minimum number of cells (in the Z direction) per layer."
        },
        {
          "name": "Cells Per Layer",
          "display": "Cells Per Layer",
          "desc": "The Cells (in the Z direction) per layer when using the selected Proportional Gridding option."
        },
        {
          "name": "Proportional Gridding",
          "display": "Proportional Gridding",
          "desc": "When multiple geologic layers exist, cells are apportioned to layers in Z, based on each layer’s average thickness over the total model domain, but further subject to the “Min Cells Per Layer” parameter.  Actual Z Resolution may be higher than specified."
        },
        {
          "name": "Minimum Layer Thickness",
          "display": "Minimum Layer Thickness",
          "desc": "Minimum Layer Thickness forces layers thinner than the specified value to have a minimum thickness and therefore not pinch-out completely."
        },
        {
          "name": "Reverse Surface Hierarchy",
          "display": "Reverse Surface Hierarchy",
          "desc": "Reverse Surface Hierarchy determines whether the surfaces will define layers in a normal (top to bottom) manner or reversed (if on)"
        }
      ]
    },
    {
      "name": "Data To Export",
      "display": "Data To Export",
      "properties": [
        {
          "name": "Geologic Nodal Data",
          "display": "Geologic Nodal Data",
          "desc": "The Geologic Nodal Data options let the user decide which data components to generate for the output field on a node by node basis. NOTE: For Structured Grids the Layer Thickness component will be exported as cell data."
        },
        {
          "name": "Geologic Cell Data",
          "display": "Geologic Cell Data",
          "desc": "The Geologic Cell Data options let the user decide which data components to generate for the output field on a cell by cell basis."
        }
      ]
    }
  ]
}