{
  "name": "import raster as horizon",
  "display": "import raster as horizon",
  "desc": "Read several different raster format files as a single horizon.",
  "categories": [
    {
      "name": "Properties",
      "display": "Properties",
      "properties": [
        {
          "name": "Reset On New File",
          "display": "Reset On New File",
          "desc": ""
        },
        {
          "name": "Material Number",
          "display": "Material Number",
          "desc": "The Material Number type in allows the user to set the material number for the surface being read."
        },
        {
          "name": "Coord Units",
          "display": "Coord Units",
          "desc": "The Coord Units type in allows the user to set the coordinate units for the surface being read."
        },
        {
          "name": "Surface Name",
          "display": "Surface Name",
          "desc": "The Surface Name type in allows the user to set the surface name for the surface being read."
        }
      ]
    },
    {
      "name": "Surface Controls",
      "display": "Surface Controls",
      "properties": [
        {
          "name": "Raster Band",
          "display": "Raster Band",
          "desc": "The Raster Band is used to select a single raster band when reading image formats such as jpeg or tif."
        },
        {
          "name": "Downsize",
          "display": "Downsize",
          "desc": "The Downsize value is used to reduce the resolution of the input raster."
        },
        {
          "name": "Blanks As Null",
          "display": "Blanks As Null",
          "desc": "The Blanks as Null option is used to specify that points marked to be blanked out in the raster will be left out of the geologic model when it is created.  It is highly recommended to leave this checked."
        },
        {
          "name": "Min I",
          "display": "Min I",
          "desc": "The Min I value is used to crop the lower bound of the horizontal domain of the raster."
        },
        {
          "name": "Max I",
          "display": "Max I",
          "desc": "The Max I value is used to crop the upper bound of the horizontal domain of the raster."
        },
        {
          "name": "Min J",
          "display": "Min J",
          "desc": "The Min J value is used to crop the lower bound of the vertical range of the raster."
        },
        {
          "name": "Max J",
          "display": "Max J",
          "desc": "The Max J value is used to crop the upper bound of the vertical range of the raster."
        },
        {
          "name": "Max Total Resolution",
          "display": "Max Total Resolution",
          "desc": "The Max Total Resolution will cause the module to report an error if the generated geology is greater than the set amount."
        }
      ]
    }
  ]
}