{
  "name": "krig 3d geology",
  "display": "krig 3d geology",
  "desc": "Estimate the geologic surface information from ....",
  "categories": [
    {
      "name": "Properties",
      "display": "Properties",
      "properties": [
        {
          "name": "Switch Property View",
          "display": "Switch Property View",
          "desc": "Edit the renderable (red) port properties for the module."
        }
      ]
    },
    {
      "name": "Grid Settings",
      "display": "Grid Settings",
      "properties": [
        {
          "name": "Grid Type",
          "display": "Grid Type",
          "desc": "The Grid Type defines the nature of the domain that will be kriged. The Rectilinear option is used when the user wishes to produce a model that contains estimated values everywhere inside a user specified rectangular domain. The Convex Hull Option is used when the user wishes to produce a model that can have an irregular boundary that is defined by the distribution of measured data points. The Convex Hull of a data set can be thought of as the domain that would be outlined by stretching a rubber band around the external data points in the data set.  The Finite Difference domain allows the user to krige the elevations of the geologic layers directly to the finite difference grid node locations set using the finite difference controls."
        },
        {
          "name": "Only Create Grid",
          "display": "Only Create Grid",
          "desc": "The Only Create Grid toggle forces the module to exit after the gridding is complete with no interpolation done."
        },
        {
          "name": "Grid Origin",
          "display": "Grid Origin",
          "desc": "The Grid Origins allow the user to set the minimum coordinate domain in which kriging of the geologic surfaces will be completed."
        },
        {
          "name": "Grid Maximum Extents",
          "display": "Grid Maximum Extents",
          "desc": "The Grid Maximum Extents allow the user to set the maximum coordinate domain in which kriging of the geologic surfaces will be completed. This control is disabled for Finite Difference Gridding."
        },
        {
          "name": "X Resolution",
          "display": "X Resolution",
          "desc": "The X Resolution specifies the number of grid nodes that will be included within the model's X domain. The number of grid elements along the X axis of the model is simply the X Resolution minus one, as every element has two bounding nodes."
        },
        {
          "name": "Y Resolution",
          "display": "Y Resolution",
          "desc": "The Y Resolution specifies the number of grid nodes that will be included within the model's Y domain. The number of grid elements along the Y axis of the model is simply the Y Resolution minus one, as every element has two bounding nodes."
        },
        {
          "name": "Boundary Offset",
          "display": "Boundary Offset",
          "desc": "The Boundary Offset parameter sets the distance that the convex hull for the kriging domain will be set outside of the actual convex hull of the data. This parameter allows the user to specify the distance outside of the actual data in which the parameter values will be extrapolated."
        },
        {
          "name": "Grid Rotation",
          "display": "Grid Rotation",
          "desc": "The Grid Rotation is for rotating a finite difference grid around the Min X, Min Y point."
        },
        {
          "name": "Finite Difference Grid",
          "display": "Finite Difference Grid",
          "desc": "This window allows the creation of a model broken into regions. There is no limit to the number of regions and each region can have any number cells and can have cells sizes that vary. The user builds the finite difference model grid by specifying the distance between the first and second grid nodes (or the element width) in the Initial Cell Size input field. The number of cells in this region is then specified in the Cells To Add input field. If a gradually varying cell size is desired, then a multiplication factor is specified in the Cell Size Change input field. Values greater than 1.0 create an increasing element size, and values less than 1.0 create diminishing element sizes."
        },
        {
          "name": "Display Grid",
          "display": "Display Grid",
          "desc": "The Display Grid control allows the user to display the grid in the red output port."
        },
        {
          "name": "Grid Vertical Scale",
          "display": "Grid Vertical Scale",
          "desc": "The Grid Vertical Scale is the Z exaggeration of the output display grid, this does not affect the elevation data on the grid."
        }
      ]
    },
    {
      "name": "Krig Settings",
      "display": "Krig Settings",
      "properties": [
        {
          "name": "Reach",
          "display": "Reach",
          "desc": "The Reach input field defines the radial distance (in user units) from any given model node that the kriging module will look for data points to be included in the estimation of the model parameter at that node. Setting the reach to 0 will result in the module calculating a reach value which is approximately two-thirds of the longest distance between any two data points in the data set."
        },
        {
          "name": "Points In Reach",
          "display": "Points In Reach",
          "desc": "The Points In Reach parameter defines the maximum number of data points (within the specified reach) that will be considered for the parameter estimation at a model node."
        },
        {
          "name": "Quadrant Search",
          "display": "Quadrant Search",
          "desc": "Quadrant Search changes the method by which data sample points are selected for inclusion in the kriging matrix. If this is on searching is performed for each of the four quadrants surrounding the point to be kriged."
        },
        {
          "name": "Use All Data",
          "display": "Use All Data",
          "desc": "The Use All Data parameter will cause all of the data points to be used when kriging not just those within the reach.  This provides the smoothest surfaces, and can even be faster in some cases."
        },
        {
          "name": "Max Points For Use All Data",
          "display": "Max Points For Use All Data",
          "desc": "The Max Points For Use All Data provides a cap for large models.  If the number of points in the file is greater than this cap then reach/points method of kriging will be used."
        },
        {
          "name": "Estimate In Thickness Space",
          "display": "Estimate In Thickness Space",
          "desc": "The Estimate In Thickness Space option is used for .geo files.  When the option is on, surfaces can not rise above the surfaces above them unless the are flagged as pinched values.  With it off, pinch flags are ignored and each surface will be kriged independently of the other surfaces."
        },
        {
          "name": "Bottom In Thickness Space",
          "display": "Bottom In Thickness Space",
          "desc": "The Bottom in Thickness Space toggle will cause the last horizon to be treated in thickness space as well as the middle horizons."
        },
        {
          "name": "Pinch Factor",
          "display": "Pinch Factor",
          "desc": "The Pinch Factor parameter provides the ability to control where pinching occurs between positive thicknesses and borings having the pinch flag.  It defaults to 1.0 which causes pinching to occur approximately half-way between positive thicknesses and borings having the pinch flag."
        },
        {
          "name": "Points In Pinch",
          "display": "Points In Pinch",
          "desc": "The Points In Pinch parameter determines how many of the nearest points will be used to determine the estimated thickness at the pinch flag location."
        },
        {
          "name": "Use Gradients",
          "display": "Use Gradients",
          "desc": "The Use Gradients option is used Natural Neighbor interpolation.  When the option is on, gradients estimated at the sample points improve the interpolation result."
        },
        {
          "name": "Estimation Method",
          "display": "Estimation Method",
          "desc": "Each method has its pros and cons and should be researched before being changed."
        },
        {
          "name": "Variogram And Anisotropy",
          "display": "Variogram And Anisotropy",
          "desc": ""
        }
      ]
    },
    {
      "name": "Computational Settings",
      "display": "Computational Settings",
      "properties": [
        {
          "name": "Computational Surface Type",
          "display": "Computational Surface Type",
          "desc": "A Computational Surface should be created after the initial gridding is complete.  Then the suface type should be selected."
        },
        {
          "name": "Include Surface",
          "display": "Include Surface",
          "desc": "The Include Surface parameter allows a user selected surface from the file to be included in the output."
        },
        {
          "name": "Include Surface Number",
          "display": "Include Surface Number",
          "desc": "If Include Surface is selected then the user can set which surface number to include."
        },
        {
          "name": "Surface Position",
          "display": "Surface Position",
          "desc": "If Include Surface is selected and the suface number is set then the user should decide whether that suface is above or below the computational surface."
        },
        {
          "name": "Heading Dip Value",
          "display": "Heading Dip Value",
          "desc": "The Heading and Dip values are used to align the Computational Surface."
        },
        {
          "name": "Elevation",
          "display": "Elevation",
          "desc": "The Elevation to translate the heading-dip plane by."
        },
        {
          "name": "Anchor Point",
          "display": "Anchor Point",
          "desc": "The Anchor Point values to translate the heading-dip plane by by."
        },
        {
          "name": "Material ID",
          "display": "Material ID",
          "desc": "The Material ID for the generated surface."
        },
        {
          "name": "Surface Name",
          "display": "Surface Name",
          "desc": "The Surface Name for the generated surface."
        },
        {
          "name": "Elevation Surfaces",
          "display": "Elevation Surfaces",
          "desc": "The computational surfaces created by this method are based upon set elevations."
        },
        {
          "name": "Depth From",
          "display": "Depth From",
          "desc": "The method for determining the starting elevation to make each depth from."
        },
        {
          "name": "Surface Number",
          "display": "Surface Number",
          "desc": "The surface number to compute depths from."
        },
        {
          "name": "Depth Layers",
          "display": "Depth Layers",
          "desc": "The computational layers created by this method are based upon the depth from the selected surface."
        }
      ]
    },
    {
      "name": "Variography Display",
      "display": "Variography Display",
      "properties": [
        {
          "name": "Display Variogram Ellipse",
          "display": "Display Variogram Ellipse",
          "desc": "The Display Variogram Ellipsoid control allows the user to display the variography ellipse."
        },
        {
          "name": "Resolution",
          "display": "Resolution",
          "desc": "The resolution to use for the ellipse. Larger numbers create more detailed representations."
        },
        {
          "name": "Ellipse Scale",
          "display": "Ellipse Scale",
          "desc": "The Ellipse Scale will scale the ellipse equally along each axis."
        },
        {
          "name": "X Offset",
          "display": "X Offset",
          "desc": "The X Offset slider will allow the user to translate the ellipse along the x axis"
        },
        {
          "name": "Y Offset",
          "display": "Y Offset",
          "desc": "The Y Offset slider will allow the user to translate the ellipse along the y axis"
        },
        {
          "name": "Z Offset",
          "display": "Z Offset",
          "desc": "The Z Offset slider will allow the user to translate the ellipse along the z axis"
        },
        {
          "name": "Ellipsoid Color",
          "display": "Ellipsoid Color",
          "desc": "The ellipse is a solid color which can be selected using this control."
        },
        {
          "name": "Display Variogram Lines",
          "display": "Display Variogram Lines",
          "desc": "The Display Variogram Lines allow the user to display lines aligned with the variography ellipse."
        },
        {
          "name": "Line Scale",
          "display": "Line Scale",
          "desc": "The Line Scale is a scalar that sets the lenght of the variogram lines relative the scale of the ellipse."
        },
        {
          "name": "Primary Ratio Color",
          "display": "Primary Ratio Color",
          "desc": "The primary ratio axis is a solid color which can be selected using this control."
        },
        {
          "name": "Secondary Ratio Color",
          "display": "Secondary Ratio Color",
          "desc": "The secondary ratio axis is a solid color which can be selected using this control."
        }
      ]
    },
    {
      "name": "Variography Display",
      "display": "Variography Display",
      "properties": [
        {
          "name": "Display Variogram Ellipse",
          "display": "Display Variogram Ellipse",
          "desc": "The Display Variogram Ellipse control allows the user to display the variography ellipse."
        },
        {
          "name": "Ellipse Opacity",
          "display": "Ellipse Opacity",
          "desc": "The Ellipse Opacity control allows the user to set the opacity of the ellipse directly"
        },
        {
          "name": "Resolution",
          "display": "Resolution",
          "desc": "The resolution to use for the ellipse. Larger numbers create more detailed representations."
        },
        {
          "name": "Ellipse Scale",
          "display": "Ellipse Scale",
          "desc": "The Ellipse Scale will scale the ellipse equally along each axis."
        },
        {
          "name": "X Offset",
          "display": "X Offset",
          "desc": "The X Offset slider will allow the user to translate the ellipse along the x axis"
        },
        {
          "name": "Y Offset",
          "display": "Y Offset",
          "desc": "The Y Offset slider will allow the user to translate the ellipse along the y axis"
        },
        {
          "name": "Z Offset",
          "display": "Z Offset",
          "desc": "The Z Offset slider will allow the user to translate the ellipse along the z axis"
        },
        {
          "name": "Ellipse Color",
          "display": "Ellipse Color",
          "desc": "The ellipse is a solid color which can be selected using this control."
        },
        {
          "name": "Display Variogram Lines",
          "display": "Display Variogram Lines",
          "desc": "The Display Variogram Lines allow the user to display lines aligned with the variography ellipse."
        },
        {
          "name": "Line Scale",
          "display": "Line Scale",
          "desc": "The Line Scale is a scalar that sets the lenght of the variogram lines relative the scale of the ellipse."
        },
        {
          "name": "Primary Ratio Color",
          "display": "Primary Ratio Color",
          "desc": "The primary ratio axis is a solid color which can be selected using this control."
        },
        {
          "name": "Secondary Ratio Color",
          "display": "Secondary Ratio Color",
          "desc": "The secondary ratio axis is a solid color which can be selected using this control."
        }
      ]
    }
  ]
}