{
  "name": "polyline processing",
  "display": "polyline processing",
  "desc": "Accepts a 3D polyline and can either increase or decrease the number of line segments of the polyline, as well as smooth or spline the polyline.",
  "categories": [
    {
      "name": "Properties",
      "display": "Properties",
      "properties": [
        {
          "name": "Switch Property View",
          "display": "Switch Property View",
          "desc": "Edit the renderable (red) port properties for the module."
        },
        {
          "name": "Specification Method",
          "display": "Specification Method",
          "desc": "The output line segment size can be adjusted via two options in the Specification Method; Number of Points mode or Path Step Size mode. Choosing the Number of Points toggle allows line smoothing adjustments by specifying the number of line segments (endpoints). Choosing the Path Step Size toggle allows smoothing adjustments by specifying the step size (in the units of the input mesh). The largest angle between any two line segments created by this module is displayed in the Max Angle of lines field."
        },
        {
          "name": "Number Of Points",
          "display": "Number Of Points",
          "desc": "If the Specification Method is set to Number Of Points, the total number of points in the path can be set using this control."
        },
        {
          "name": "Path Step Size",
          "display": "Path Step Size",
          "desc": "If the Path Step Size is selected from the Specification Method the length of each path step in the units of the input mesh."
        },
        {
          "name": "Resample At End",
          "display": "Resample At End",
          "desc": "If the Resample At End toggle is ON, the line is segmented before and after being smoothed or splined."
        },
        {
          "name": "Tolerance",
          "display": "Tolerance",
          "desc": "The Tolerance parameter determines how close two disjoint points must before the two polylines are merged."
        },
        {
          "name": "Sampling Method",
          "display": "Sampling Method",
          "desc": "The Sampling Method allows the user to change how the polyline is created.  For Spline, the module will connect each point with a path that is determined by the gradient of the points.  The Smooth method will keep to the original path, sharp corners will be smoothed using the Smoothing Percentage. The Preserve Nodes method will keep the same path as the input, but will break the path into smaller segments."
        },
        {
          "name": "Smoothing Order",
          "display": "Smoothing Order",
          "desc": "The Smoothing Order determines the number of points to be used for splining. More points creates a smoother line that departs more from the original."
        },
        {
          "name": "Smoothing Percentage",
          "display": "Smoothing Percentage",
          "desc": "The Smoothing Percentage determines the degree of smoothing. Higher values creates a smoother line that departs more from the original."
        },
        {
          "name": "Smoothing Iterations",
          "display": "Smoothing Iterations",
          "desc": "The Smoothing Iterations is analogous to multiple polyline_spline modules connected in series. This provides a means to further smooth erratic lines while staying close to the original points"
        },
        {
          "name": "ELF Filename",
          "display": "ELF Filename",
          "desc": "This button allows the user to output the created polyline as an ELF file."
        }
      ]
    }
  ]
}