{
  "name": "read image",
  "display": "read image",
  "desc": "Reads an image file of a specified type and converts it into an 2D uniform field. It can optionally perform some basic image manipulation upon the read image. It also automatically looks for a world file or GCP file associated with the image in the same folder. Since this is done automatically, the world file name must conform to industry standards.",
  "categories": [
    {
      "name": "Properties",
      "display": "Properties",
      "properties": [
        {
          "name": "Frame Number",
          "display": "Frame Number",
          "desc": "The Frame Number is used for reading from animations. An animation file can be specified (such as a HAV or AVI file), and a specific frame read as the image. "
        },
        {
          "name": "Image Opacity",
          "display": "Image Opacity",
          "desc": "The Opacity of the image."
        },
        {
          "name": "Image Quality",
          "display": "Image Quality",
          "desc": "The Image Quality allows the user to select the maximum resolution to read the input image in at.  This allows the user to create a coarse image for faster testing and a high resolution image for the final output."
        },
        {
          "name": "X Resolution",
          "display": "X Resolution",
          "desc": "The X Resolution of the image can be set directly if the Manual Resize option is selected in Downsize Options."
        },
        {
          "name": "Y Resolution",
          "display": "Y Resolution",
          "desc": "The Y Resolution of the image can be set directly if the Manual Resize option is selected in Downsize Options."
        }
      ]
    },
    {
      "name": "Border Options",
      "display": "Border Options",
      "properties": [
        {
          "name": "Add Border",
          "display": "Add Border",
          "desc": "The Add Border toggle will add a border around your image.  This border is useful when you image is smaller than your objects extent, preventing streaking."
        },
        {
          "name": "Border Color",
          "display": "Border Color",
          "desc": "The color of the border."
        },
        {
          "name": "Border Opacity",
          "display": "Border Opacity",
          "desc": "The Opacity of the added border"
        },
        {
          "name": "Border Size",
          "display": "Border Size",
          "desc": "The Border Size is the number of pixels to add around the image extents. Larger borders are necessary if the object being texture mapped has coarse resolution. You can tell if you need a large border if the border appears saw-toothed."
        }
      ]
    },
    {
      "name": "Image Processing",
      "display": "Image Processing",
      "properties": [
        {
          "name": "Flip Image",
          "display": "Flip Image",
          "desc": "The Flip Image toggle when selected will invert the image about the x axis, i.e. in the vertical direction. The renderers assume that the image origin is at the lower left. Use this toggle if the image is rendered upside-down."
        },
        {
          "name": "Sharpen Image",
          "display": "Sharpen Image",
          "desc": "The Soften Image toggle makes the image smoother by applying low intensity pixel averaging."
        },
        {
          "name": "Soften Image",
          "display": "Soften Image",
          "desc": "The Sharpen Image toggle increases the visibility of details on the image."
        },
        {
          "name": "Edge Enhance",
          "display": "Edge Enhance",
          "desc": "The Edge Enhance toggle enhances the edges of the objects and discards other image information."
        },
        {
          "name": "Brightness",
          "display": "Brightness",
          "desc": "The Brightness of the image can be adjusted when the Adjust Brightness toggle is selected"
        },
        {
          "name": "Contrast",
          "display": "Contrast",
          "desc": "The Contrast of the image can be be adjusted when the Adjust Contrast toggle is selected."
        },
        {
          "name": "White Balance Red",
          "display": "White Balance Red",
          "desc": "The red channel of the white balance can be adjusted when the Adjust White Balance toggle is selected."
        },
        {
          "name": "White Balance Green",
          "display": "White Balance Green",
          "desc": "The green channel of the white balance can be adjusted when the Adjust White Balance toggle is selected."
        },
        {
          "name": "White Balance Blue",
          "display": "White Balance Blue",
          "desc": "The blue channel of the white balance can be adjusted when the Adjust White Balance toggle is selected."
        },
        {
          "name": "Gamma Correct Red",
          "display": "Gamma Correct Red",
          "desc": "The red channel of the images gamma values can be adjusted when the Gamma Correct Image toggle is selected."
        },
        {
          "name": "Gamma Correct Green",
          "display": "Gamma Correct Green",
          "desc": "The green channel of the images gamma values can be adjusted when the Gamma Correct Image toggle is selected."
        },
        {
          "name": "Gamma Correct Blue",
          "display": "Gamma Correct Blue",
          "desc": "The blue channel of the images gamma values can be adjusted when the Gamma Correct Image toggle is selected."
        }
      ]
    }
  ]
}