{
  "name": "streamlines",
  "display": "streamlines",
  "desc": "The streamlines module is used to produce streamlines or streamribbons of a field which is a 2 or 3 element vector data component on any type of mesh.",
  "categories": [
    {
      "name": "Properties",
      "display": "Properties",
      "properties": [
        {
          "name": "Switch Property View",
          "display": "Switch Property View",
          "desc": "Edit the renderable (red) port properties for the module."
        },
        {
          "name": "Vector Nodal Data",
          "display": "Vector Nodal Data",
          "desc": "The Vector Nodal Data displays all nodal data, vector and scalar, passed to the Input Field.  A vector data component must be selected to create streamlines."
        },
        {
          "name": "Time Units",
          "display": "Time Units",
          "desc": "The Time Units control allows the user to specify the type of units used in the input field."
        },
        {
          "name": "Flow Direction",
          "display": "Flow Direction",
          "desc": "The Flow Direction allows the user to select the direction the lines will flow."
        }
      ]
    },
    {
      "name": "Terminating Conditions",
      "display": "Terminating Conditions",
      "properties": [
        {
          "name": "Segments Per Cell",
          "display": "Segments Per Cell",
          "desc": "The Segments Per Cell is used to set the number of integration steps to be used in each cell (i.e., the number of divisions of the cells) to calculate the streamline."
        },
        {
          "name": "Order",
          "display": "Order",
          "desc": "The Order control is used to set the order of the integration. Higher order integration is more accurate, but executes much slower."
        },
        {
          "name": "Max Segments Total",
          "display": "Max Segments Total",
          "desc": "The Max Segments Total control is used to set the maximum allowable number of streamline segments that will be completed for each streamline. If the number of segments along a streamline exceeds the max number, the streamline is terminated at the end of the last (max) segment."
        },
        {
          "name": "Minimum Velocity",
          "display": "Minimum Velocity",
          "desc": "The Min Velocity value is used to specify the minimum velocity that will be considered in the integration. If the magnitude of the velocity field in a region is less than this minimum value, streamlines will end in that region (or will not be produced if the gradient at a starting point is less than the min). Setting this to a lower value will produce longer streamlines (and typically more). Higher values tend to produce less streamlines and shorter streamlines. If streamlines are not visible on the data set, setting this to a lower value may produce streamlines."
        },
        {
          "name": "Extinction Angle",
          "display": "Extinction Angle",
          "desc": "The Extinction Angle value is used to specify the maximum allowable angle between successive line segments before integration (streamline generation) should be terminated."
        }
      ]
    },
    {
      "name": "Display Settings",
      "display": "Display Settings",
      "properties": [
        {
          "name": "Output Nodal Data",
          "display": "Output Nodal Data",
          "desc": "The Output Nodal Data allows the user to select how to color the output stream lines."
        },
        {
          "name": "Coloring",
          "display": "Coloring",
          "desc": "The Coloring control allow the user to specify how to process the Output Nodal Data."
        },
        {
          "name": "Minimum Clamp Value",
          "display": "Minimum Clamp Value",
          "desc": "The Minimum Clamp Value allows the user to reset the min values of the display Output Nodal Data for coloring purposes by clamping the data."
        },
        {
          "name": "Maximum Clamp Value",
          "display": "Maximum Clamp Value",
          "desc": "The Maximum Clamp Value allows the user to reset the max values of the display Output Nodal Data for coloring purposes by clamping the data."
        }
      ]
    }
  ]
}