{
  "name": "triangle refinement",
  "display": "triangle refinement",
  "desc": "Clean, break up cells, and flip normals on an input surface.",
  "categories": [
    {
      "name": "Properties",
      "display": "Properties",
      "properties": [
        {
          "name": "Switch Property View",
          "display": "Switch Property View",
          "desc": "Edit the renderable (red) port properties for the module."
        },
        {
          "name": "Remove Coincident Nodes",
          "display": "Remove Coincident Nodes",
          "desc": "The Remove Coincident Nodes toggle is used to merge nodes that have multiple nodes occupying the same coordinate space."
        },
        {
          "name": "Remove Small Area Cells",
          "display": "Remove Small Area Cells",
          "desc": "The Remove Small Area Cells toggle is used to remove extremely small cells (based on area in your coordinate units squared) that sometimes are generated with CAD triangulation routines that might have their normal vectors reversed and would contribute to poor cutting surface definition."
        },
        {
          "name": "Small Area Value",
          "display": "Small Area Value",
          "desc": "If Remove Small Area Cells is selected the Small Area Value is the cut off value."
        },
        {
          "name": "Split Cells",
          "display": "Split Cells",
          "desc": "The Split Cells toggle is used to ensure that none of the triangles have an edge longer than the maximum edge length."
        },
        {
          "name": "Maximum Edge Length",
          "display": "Maximum Edge Length",
          "desc": "The Maximum Edge Length value allows the maximum length of each triangle side to be set for when the Split Cells toggle is set."
        }
      ]
    },
    {
      "name": "Triangle Normal Settings",
      "display": "Triangle Normal Settings",
      "properties": [
        {
          "name": "Fix Normals",
          "display": "Fix Normals",
          "desc": "The Fix Normals toggle is used to check to make sure all of the triangles in selected patches of the surface have the same normal. If the normal is backwards, you can flip the normal of the patch in two ways. The first way is Ctrl + Left click on a cell in the patch that you wish to flip and then add the patch to flip list using its cell data value. You only need to do this for one cell in each patch. The Cell Data values should be gotten from the surface being output from tri_tool, and not the surface being input."
        },
        {
          "name": "Picked Cell Number",
          "display": "Picked Cell Number",
          "desc": "The Current Cell number being probed.  This number is just used as a reference when probing."
        },
        {
          "name": "Picked Cell Data",
          "display": "Picked Cell Data",
          "desc": "The Current Cell Data value being probed.  This number should be added to the Flip List if that patch needs to be flipped."
        },
        {
          "name": "Flip List",
          "display": "Flip List",
          "desc": "The list of patches to have their normals flipped.  Each patch is identified by its cell data value. The default value for each added member is the Picked Cell Data if that has been set."
        }
      ]
    }
  ]
}