{
  "name": "viewer",
  "display": "viewer",
  "desc": "The Viewer displays all 3D models.",
  "categories": [
    {
      "name": "Properties",
      "display": "Properties",
      "properties": [
        {
          "name": "Show Contents",
          "display": "Show Contents",
          "desc": "Shows or Hides the Viewer Contents"
        },
        {
          "name": "Detached Objects",
          "display": "Detached Objects",
          "desc": ""
        },
        {
          "name": "Detached Annotations",
          "display": "Detached Annotations",
          "desc": ""
        },
        {
          "name": "Azimuth And Inclination",
          "display": "Azimuth And Inclination",
          "desc": "The Azimuth And Inclination control allows the user to set the orientation of the View"
        },
        {
          "name": "Set To Top View",
          "display": "Set To Top View",
          "desc": "Zooms to fit the entire model, and displays it centered from top down."
        },
        {
          "name": "Zoom To Fit",
          "display": "Zoom To Fit",
          "desc": "Zooms to fit the entire model, and re-centers around the centroid of the scene."
        },
        {
          "name": "Bookmarked Views",
          "display": "Bookmarked Views",
          "desc": "Saved views which can be reused."
        },
        {
          "name": "Bookmarked States",
          "display": "Bookmarked States",
          "desc": "Saved states which can be reused."
        },
        {
          "name": "Picked Object",
          "display": "Picked Object",
          "desc": "The Picked Object displays the current object selected in the Viewer.  This object can be be updated by holding the Ctrl button and clicking on an object in the Viewer."
        },
        {
          "name": "Picked Coordinate",
          "display": "Picked Coordinate",
          "desc": "The Picked Coordinate displays the coordinates of the current object selected in the Viewer.  This object can be be updated by holding the Ctrl button and clicking on an object in the Viewer."
        },
        {
          "name": "Center On Picked",
          "display": "Center On Picked",
          "desc": "If an object has been picked in the Viewer, the Center On Picked button will force the Viewer to center around that object."
        },
        {
          "name": "Show Viewer Center",
          "display": "Show Viewer Center",
          "desc": "Shows an indicator of the current view center point"
        },
        {
          "name": "Perspective Mode",
          "display": "Perspective Mode",
          "desc": "Perspective is an important feature, which is off by default. Normally we use a non-perspective view, which displays parallel lines as parallel. Objects are the same size regardless of their distance from the viewer. Perspective gives a view that can be likened to a camera view through a wide-angle lens. It sometimes seems more realistic, but perhaps less scientific (quantitative). The perspective option is used in conjunction with the Field of View. Generally, objects will appear the same size (but distorted) with a 45 degree perspective view and the default view. A smaller Field of View is like zooming in on the display and reduces perspective effects. You can compensate for changing Field of View by adjusting the Viewport Size, changing the Scale, zooming in/out, or translating the objects."
        },
        {
          "name": "Field Of View",
          "display": "Field Of View",
          "desc": "The Field of View is used in to compensate for distortion while in Perspective Mode."
        },
        {
          "name": "Renderer",
          "display": "Renderer",
          "desc": "The Renderer control provides the option for either OpenGL or Software rendering. The OpenGL renderer is a high performance renderer which is native to the Windows operating system, and is the default option. For most objects, OpenGL rendering provides much faster rendering performance than the software renderer. However, the Software renderer provides some functionality that the OpenGL renderer does not, and therefore is the desired option for some operations. Specifically, spheres are calculated in the software renderer much more quickly and efficiently then OpenGL which renders a many faceted object. If you are visualizing a large number of spheres you should choose the software rendering option. The other important difference is that the Software Renderer support Depth Sorting when your view has multiple transparent objects."
        },
        {
          "name": "Auto Fit Scene",
          "display": "Auto Fit Scene",
          "desc": "The Auto Fit Scene control tells the Viewer what kind of change will cause the Viewer to Normalize."
        }
      ]
    },
    {
      "name": "Window Size",
      "display": "Window Size",
      "properties": [
        {
          "name": "Window Sizing",
          "display": "Window Sizing",
          "desc": "The method for determining how to size the Viewer contents."
        },
        {
          "name": "Viewer Width",
          "display": "Viewer Width",
          "desc": "The width of the rendered portion of the Viewer, in pixels."
        },
        {
          "name": "Viewer Height",
          "display": "Viewer Height",
          "desc": "The height of the rendered portion of the Viewer, in pixels."
        },
        {
          "name": "Viewer Actual Width",
          "display": "Viewer Actual Width",
          "desc": "The actual width of the rendered portion of the Viewer, in pixels."
        },
        {
          "name": "Viewer Actual Height",
          "display": "Viewer Actual Height",
          "desc": "The actual height of the rendered portion of the Viewer, in pixels."
        },
        {
          "name": "Video Safe Area",
          "display": "Video Safe Area",
          "desc": "The Video Safe Area control is used when creating an animation for DVD or Video. It displays the areas that are usable for both text and animation purposes for several standard video formats. This allows you to properly setup your animation in order to get the best possible output on multiple television sets."
        }
      ]
    },
    {
      "name": "Output Image",
      "display": "Output Image",
      "properties": [
        {
          "name": "View Scale",
          "display": "View Scale",
          "desc": "The Scale to apply to both the viewers height and width when creating the image.  Values are truncated to integers when setting the actual width and height."
        },
        {
          "name": "Auto Scale Forward Facing Font",
          "display": "Auto Scale Forward Facing Font",
          "desc": "When the AutoScale Forward Facing Font toggle is selected all Forward Facing fonts in the image will be scaled depending upon the size of the output image."
        },
        {
          "name": "Anti Aliasing",
          "display": "Anti Aliasing",
          "desc": "The Anti Aliasing toggle when selected will apply a 4x4 anti-aliasing method to the output image.  This will double the rendered size of the image and then filter and subset to image to the correct width and height.  This process reduces the brightness of fine lines but it also smooths the lines and dramatically reduces jaggies."
        },
        {
          "name": "Anti Aliasing Weight Factor",
          "display": "Anti Aliasing Weight Factor",
          "desc": "The Anti Aliasing Weight Factor is used when Anti Aliasing the image.  When Anti Aliasing occurs the image is originally rendered at twice its destination size.  Each pixels color value is then interpolated by using the values of the 16 pixels that form a box around it.  The weighting factor makes the four pixels immediately surrounding the pixel a greater weight when determing the final color.  A higher weighting factor reduces the affect of anti-aliasing."
        },
        {
          "name": "Mask Background",
          "display": "Mask Background",
          "desc": "The Mask Background toggle allows you to create an image with a transparent background. Please read the help for the Viewer module for the conditions needed for this feature."
        },
        {
          "name": "Mask Color",
          "display": "Mask Color",
          "desc": "The color to mask in the output image."
        },
        {
          "name": "JPEG Quality",
          "display": "JPEG Quality",
          "desc": "The JPEG Quality value affects the (*.jpg) output files. Higher qualities result in less LOSS to the image but create much larger files. "
        },
        {
          "name": "Image Filename",
          "display": "Image Filename",
          "desc": "The image format to use when creating the image."
        },
        {
          "name": "Show Message",
          "display": "Show Message",
          "desc": ""
        }
      ]
    },
    {
      "name": "Distance Tool",
      "display": "Distance Tool",
      "properties": [
        {
          "name": "Measure Distance",
          "display": "Measure Distance",
          "desc": "Turning on the Measure Distance tool will allow the user to probe two locations in the viewer and return detailed information both about each point as well as information about the line that would connect to the two locations."
        },
        {
          "name": "First Point Location",
          "display": "First Point Location",
          "desc": "The first point probed to using CTRL + Left click. This value may be altered to change the line values, but it will make the data and object probed on invalid."
        },
        {
          "name": "Second Point Location",
          "display": "Second Point Location",
          "desc": "The second point probed to using CTRL + Left click. This value may be altered to change the line values, but it will make the data and object probed on invalid."
        },
        {
          "name": "Clear Points",
          "display": "Clear Points",
          "desc": "The Clear Points button will clear the probed points."
        },
        {
          "name": "Distance Line Color",
          "display": "Distance Line Color",
          "desc": "The Distance Line Color refers tot he color of the line between the probed locations."
        },
        {
          "name": "Point Radius",
          "display": "Point Radius",
          "desc": "The Point Radius refers to the radius of the spheres displayed at the probe location."
        },
        {
          "name": "Line Filename",
          "display": "Line Filename",
          "desc": "The EVS Line File name to process for display."
        },
        {
          "name": "File Behaviour",
          "display": "File Behaviour",
          "desc": "When an EVS Line File has been selected, the user is given the choice of either overwiting it with the stored points, or to append the points to an existing line file."
        }
      ]
    },
    {
      "name": "Background",
      "display": "Background",
      "properties": [
        {
          "name": "Style",
          "display": "Style",
          "desc": "The Style controls the how to color the Background."
        },
        {
          "name": "Use Unlocked Background",
          "display": "Use Unlocked Background",
          "desc": "If outputting the Viewer to a 4DIM file or VRML file the background should be set to Unlocked."
        },
        {
          "name": "Primary Color",
          "display": "Primary Color",
          "desc": "The Primary Color sets the background color."
        },
        {
          "name": "Secondary Color",
          "display": "Secondary Color",
          "desc": "The Secondary Color sets the second color of the two color gradient."
        }
      ]
    },
    {
      "name": "View",
      "display": "View",
      "properties": [
        {
          "name": "Depth Sort",
          "display": "Depth Sort",
          "desc": "When there are two or more transparent objects in your view, without depth sorting the appearance of which object is in front or behind can be improperly displayed.  Properly displaying multiple transparent objects requires sorting the object's order of display based on their apparent position relative to the observer.  There are two different depth sorting options, each requires progressively more computation and is therefore increasingly slower than normal rendering. These options are not available in OpenGL since none of the graphics card manufacturers support this level of sophistication."
        },
        {
          "name": "Update Automatically",
          "display": "Update Automatically",
          "desc": "User changes to the Viewer will happen be handled immediately when the Update Automatically toggle is on."
        },
        {
          "name": "Refresh",
          "display": "Refresh",
          "desc": "If Update Automatically is not toggled on, the Refresh button will cause the Viewer to handle all user changes."
        }
      ]
    },
    {
      "name": "Lights",
      "display": "Lights",
      "properties": [
        {
          "name": "Turn On Ambient Light",
          "display": "Turn On Ambient Light",
          "desc": "The Turn On Ambient Light toggle will toggle the visibility of the ambient light.  Ambient light affects all objects and is not directional."
        },
        {
          "name": "Ambient Light Color",
          "display": "Ambient Light Color",
          "desc": "The Ambient Light Color can be set with this control."
        },
        {
          "name": "Show Lights",
          "display": "Show Lights",
          "desc": "If the Show Lights toggle is set to on, the position of the lights will be shown in model space."
        },
        {
          "name": "Mouse Controls",
          "display": "Mouse Controls",
          "desc": "The Mouse Controls tell the viewer what object to transform when the mouse moves inside the Viewer."
        },
        {
          "name": "Reset Lights",
          "display": "Reset Lights",
          "desc": "The Reset Lights button will force all of the lights to return to their default values."
        },
        {
          "name": "Light 1",
          "display": "Light 1",
          "desc": "The control for this light can change its type, color, visibility, etc..."
        },
        {
          "name": "Light 2",
          "display": "Light 2",
          "desc": "The control for this light can change its type, color, visibility, etc..."
        },
        {
          "name": "Light 3",
          "display": "Light 3",
          "desc": "The control for this light can change its type, color, visibility, etc..."
        },
        {
          "name": "Light 4",
          "display": "Light 4",
          "desc": "The control for this light can change its type, color, visibility, etc..."
        }
      ]
    },
    {
      "name": "Camera",
      "display": "Camera",
      "properties": [
        {
          "name": "Normalization Scale",
          "display": "Normalization Scale",
          "desc": "The camera by default is set a distance away from all objects. The Normalization Scale reduces this distance by a set factor, making the objects appear to be closer."
        },
        {
          "name": "Normalize Invisible Objects",
          "display": "Normalize Invisible Objects",
          "desc": "The NormalizeInvisibleObjects toggle tells the Viewer whether to include objects, that have had their Visible status set to off, when adjusting its scale."
        },
        {
          "name": "Global Scale",
          "display": "Global Scale",
          "desc": "When Perspective Mode is on a smaller Field of View is like zooming in on the display and reduces perspective effects. You can compensate for changing Field of View by adjusting the Global Scale."
        },
        {
          "name": "Viewport Size",
          "display": "Viewport Size",
          "desc": "When Perspective Mode is on a smaller Field of View is like zooming in on the display and reduces perspective effects. You can compensate for changing Field of View by adjusting the Viewport Size."
        },
        {
          "name": "Tripod From",
          "display": "Tripod From",
          "desc": "The Tripod From coordinates allow the user to set the position the camera looks from."
        },
        {
          "name": "Tripod Up",
          "display": "Tripod Up",
          "desc": "The Tripod Up coordinates allow the user to set the position that describes the direction defined as 'up' for the camera.  This can produce a roll-like effect."
        },
        {
          "name": "Tripod At",
          "display": "Tripod At",
          "desc": "The Tripod At coordinates allow the user to set the position the camera is looking at."
        },
        {
          "name": "Clipping Planes Active",
          "display": "Clipping Planes Active",
          "desc": "If Clipping Planes are toggled on, objects that are too close or far from the camera will be clipped off."
        },
        {
          "name": "Clipping Plane Front Perspective",
          "display": "Clipping Plane Front Perspective",
          "desc": "If Perspective Mode is on the Clipping Plane Front Perspective sets the position of the clipping plane."
        },
        {
          "name": "Clipping Plane Front",
          "display": "Clipping Plane Front",
          "desc": "The Clipping Plane Front is the clipping plane closest to the camera, any objects in front of this plane will be clipped."
        },
        {
          "name": "Clipping Plane Back",
          "display": "Clipping Plane Back",
          "desc": "The Clipping Plane Back is the clipping plane furthest from the camera, any objects in back of this plane will be clipped."
        },
        {
          "name": "Depth Cueing Active",
          "display": "Depth Cueing Active",
          "desc": "Depth Cueing is an advanced display option, which controls the fading of the light based on the distance objects are from the viewer."
        },
        {
          "name": "Depth Cueing Front",
          "display": "Depth Cueing Front",
          "desc": "Depth Cueing is a linear blend from the Depth Cueing Front to the Back.  The Depth Cueing Front sets the position, relative to the camera, that lights are at 100 percent."
        },
        {
          "name": "Depth Cueing Back",
          "display": "Depth Cueing Back",
          "desc": "Depth Cueing is a linear blend from the Depth Cueing Front to the Back.  The Depth Cueing Back sets the position, relative to the camera, that lights are at 0 percent."
        },
        {
          "name": "Depth Cueing Scale",
          "display": "Depth Cueing Scale",
          "desc": "The Depth Cueing Scale amplifies the change between the Front and Back."
        }
      ]
    },
    {
      "name": "Record 4DIM",
      "display": "Record 4DIM",
      "properties": [
        {
          "name": "State Generation Mode",
          "display": "State Generation Mode",
          "desc": "If the State Generation Mode is set to Manual a state will be added to the 4DIM every time the Record Single State button is pressed.  If the Automatic mode is selected, every time the Viewer changes a state will be written to the file."
        },
        {
          "name": "Record Single State",
          "display": "Record Single State",
          "desc": "Record a Single State from the Viewer to the 4DIM.  The View state (i.e. Azimuth, Inclination, etc.) is saved at this time as well."
        },
        {
          "name": "Include In Preview",
          "display": "Include In Preview",
          "desc": "Include this state in the preview images for the 4dm file."
        },
        {
          "name": "Create Temporary 4DIM",
          "display": "Create Temporary 4DIM",
          "desc": "The Create Temporary 4DIM toggle allows the user to create a temporary 4d file to view the animation in progress.  This 4d file will not have the ability to track view changes."
        },
        {
          "name": "Delete Last State",
          "display": "Delete Last State",
          "desc": "Delete the Last State from the 4DIM."
        },
        {
          "name": "Clear All States",
          "display": "Clear All States",
          "desc": "Delete all states from the 4DIM."
        },
        {
          "name": "Finish 4D",
          "display": "Finish 4D",
          "desc": "The Finish 4D button will finish the creation of the 4DIM."
        },
        {
          "name": "Total States",
          "display": "Total States",
          "desc": "The Total States is a display of the total number of states recorded so far."
        },
        {
          "name": "Total Previews",
          "display": "Total Previews",
          "desc": "The Total Previews is a display of the total number of preview images captured so far."
        },
        {
          "name": "Author",
          "display": "Author",
          "desc": "The Author field allows the user to set the author name on the output 4DIM."
        },
        {
          "name": "Organization",
          "display": "Organization",
          "desc": "The Organization field allows the user to set the organization name on the output 4DIM."
        },
        {
          "name": "Track By Default",
          "display": "Track By Default",
          "desc": "Set this 4DM output to track view changes by default when opened."
        },
        {
          "name": "Notes",
          "display": "Notes",
          "desc": "The Notes field allows the user to set any notes for the output 4DIM."
        }
      ]
    },
    {
      "name": "Write VRML",
      "display": "Write VRML",
      "properties": [
        {
          "name": "VRML Filename",
          "display": "VRML Filename",
          "desc": "The output VRML file name.  Setting this filename will cause the file to be written."
        },
        {
          "name": "Output Optimization",
          "display": "Output Optimization",
          "desc": "The Output Optimization sets the type of output to optimize the VRML for."
        }
      ]
    }
  ]
}