{
  "properties": [
    {
      "name": "Z Scale",
      "display": "Z §çáℓè",
      "desc": "Z ƨçáℓè ïƨ ƭλè ƨçáℓïñϱ ƒáçƭôř ƒôř Ʋèřƭïçáℓ (ƺ) çôôřδïñáƭèƨ."
    },
    {
      "name": "Explode",
      "display": "Éжƥℓôδè",
      "desc": "Tλè Éжƥℓôδè Ʋáℓúè ïƨ ƭλè δïƨƭáñçè βèƭωèèñ èжƥℓôδèδ ℓá¥èřƨ, çèℓℓ ƨèƭƨ ôř ₥áƭèřïáℓƨ.  Fôř èжá₥ƥℓè, áñ èжƥℓôδè δïƨƭáñçè ôƒ 20 ωïℓℓ ƨèƥářáƭè èáçλ ϱèôℓôϱïç ℓá¥èř β¥ 20 ƒèèƭ ƒřô₥ ƭλè ℓá¥èř áβôƲè ïƭ áñδ ƭλè ℓá¥èř βèℓôω ïƭ. Nôƭè ƭλáƭ ƭλè èжƥℓôδè δïƨƭáñçè ïñçôřƥôřáƭèƨ ƭλè ƨçáℓè ƒáçƭôř, ƨô ƭλáƭ ïƒ á ƨçáℓïñϱ ƒáçƭôř ôƒ 5 ïƨ ƨƥèçïƒïèδ ƒôř á 10 ƒôôƭ ƭλïçƙ ℓá¥èř ƭô ωλïçλ áñ èжƥℓôδè ƒáçƭôř ôƒ 20 ïƨ áƥƥℓïèδ, ƭλè ϱèôℓôϱïç ℓá¥èřƨ ωïℓℓ βè ƨèƥářáƭèδ β¥ 100 ƒèèƭ."
    },
    {
      "name": "Output Quality",
      "display": "Óúƭƥúƭ Qúáℓïƭ¥",
      "desc": ""
    },
    {
      "name": "Configuration Executed",
      "display": "Çôñƒïϱúřáƭïôñ Éжèçúƭèδ",
      "desc": ""
    },
    {
      "name": "Allow Run",
      "display": "Âℓℓôω Rúñ",
      "desc": "Tλè Âℓℓôω Rúñ ƭôϱϱℓè çôñƭřôℓƨ ωλèƭλèř ƭλè ₥ôδúℓè ωïℓℓ řúñ ωλèñ áƥƥℓïçáƭïôñƨ ářè ℓôáδèδ ôř δáƭá çλáñϱèƨ. Wλèñ ƭλïƨ ïƨ ôñ, ƭλè ₥ôδúℓè řúñƨ ωλèñ áƥƥℓïçáƭïôñƨ ářè ℓôáδèδ ôř ƭλè Éжèçúƭè βúƭƭôñ ïƨ ƥúƨλèδ (ôř ƭλè ϱèôℓôϱ¥ ïñƥúƭ çλáñϱèƨ). Wλèñ ïƭ ïƨ ôƒƒ, ƭλè ₥ôδúℓè ωïℓℓ ñôƭ řúñ úñℓèƨƨ Éжèçúƭè ïƨ ƥřèƨƨèδ."
    },
    {
      "name": "Filename",
      "display": "Fïℓèñá₥è",
      "desc": "Tλè ƒïℓèñá₥è çôñƭáïñïñϱ ƭλè δáƭá ƭô ïñƭèřƥôℓáƭè ôñƭô ƭλè çřèáƭèδ ϱřïδ."
    },
    {
      "name": "Execute",
      "display": "Éжèçúƭè",
      "desc": "Tλè Éжèçúƭè βúƭƭôñ ƒôřçèƨ ƭλè ₥ôδúℓè ƭô řúñ. Ìƒ ƭλïƨ λáƨ βèèñ ƥřèƨƨèδ áñδ ƭλè áƥƥℓïçáƭïôñ ƨáƲèδ, ïƭ ωïℓℓ çáúƨè ƭλè ₥ôδúℓè ƭô řúñ ωλèñ ƭλè áƥƥℓïçáƭïôñ ïƨ ℓôáδèδ."
    },
    {
      "name": "Port Name",
      "display": "Þôřƭ Ná₥è",
      "desc": "Ðïƨƥℓá¥ƨ ƭλè ñá₥è ôƒ ôúƭƥúƭ ƥôřƭ úƨèδ ïñ ƭλïƨ çôññèçƭïôñ."
    },
    {
      "name": "Port Description",
      "display": "Þôřƭ Ðèƨçřïƥƭïôñ",
      "desc": "Ðïƨƥℓá¥ƨ ƭλè δèƨçřïƥƭïôñ ôƒ ôúƭƥúƭ ƥôřƭ úƨèδ ïñ ƭλïƨ çôññèçƭïôñ."
    },
    {
      "name": "Port Type",
      "display": "Þôřƭ T¥ƥè",
      "desc": "Ðïƨƥℓá¥ƨ ƭλè ƭ¥ƥè ôƒ ôúƭƥúƭ ƥôřƭ úƨèδ ïñ ƭλïƨ çôññèçƭïôñ."
    },
    {
      "name": "Port Subtypes",
      "display": "Þôřƭ §úβƭ¥ƥèƨ",
      "desc": "Ðïƨƥℓá¥ƨ ƭλè çúřřèñƭ ƨúβƭ¥ƥèƨ ôƒ ôúƭƥúƭ ƥôřƭ úƨèδ ïñ ƭλïƨ çôññèçƭïôñ."
    },
    {
      "name": "Node Data",
      "display": "Nôδè Ðáƭá",
      "desc": "Ìƒ Çôℓôř ß¥ ïƨ ƨèƭ ƭô Nôδè Ðáƭá ƭλè Nôδáℓ Ðáƭá Çô₥ƥôñèñƭ ƨèℓèçƭƨ ωλïçλ ñôδáℓ δáƭá ωïℓℓ ƨèƭ ƭλè δáƭá ₥áƥ."
    },
    {
      "name": "Cell Data",
      "display": "Çèℓℓ Ðáƭá",
      "desc": "Ìƒ Çôℓôř ß¥ ïƨ ƨèƭ ƭô Çèℓℓ Ðáƭá ƭλè Çèℓℓ Ðáƭá Çô₥ƥôñèñƭ ƨèℓèçƭƨ ωλïçλ çèℓℓ δáƭá ωïℓℓ ƨèƭ ƭλè δáƭá ₥áƥ."
    },
    {
      "name": "Vector Component",
      "display": "Vèçƭôř Çô₥ƥôñèñƭ",
      "desc": "Ìƒ Tèжƭúřè ß¥ ïƨ ƨèƭ ƭô èïƭλèř Nôδè Ðáƭá ôř Çèℓℓ Ðáƭá ƭλè Vèçƭôř Çô₥ƥôñèñƭ áℓℓôωƨ ƭλè úƨèř ƭô úƨè Júƨƭ á ƨïñϱℓè çô₥ƥôñèñƭ ôƒ á Ʋèçƭôř δáƭá ƭô ƨèƭ ƭλè ƭèжƭúřè."
    },
    {
      "name": "Use Vector Magnitude",
      "display": "Ûƨè Vèçƭôř Máϱñïƭúδè",
      "desc": "Ìƒ Tèжƭúřè ß¥ ïƨ ƨèƭ ƭô èïƭλèř Nôδè Ðáƭá ôř Çèℓℓ Ðáƭá ƭλè Ûƨè Vèçƭôř Máϱñïƭúδè áℓℓôωƨ ƭλè úƨèř ƭô úƨè ƭλè ₥áϱñïƭúδè ôƒ á Ʋèçƭôř δáƭá ƭô ƨèƭ ƭλè ƭèжƭúřè."
    },
    {
      "name": "Object Color",
      "display": "ÓβJèçƭ Çôℓôř",
      "desc": "Ìƒ ƭλèřè ïƨ ñô δáƭá áƨƨôçïáƭèδ ωïƭλ ƭλè ₥ôδèℓ, ƭλè δèƒáúℓƭ çôℓôř çáñ βè ƨèƭ ωïƭλ ƭλèƨè çôñƭřôℓƨ."
    },
    {
      "name": "Color Type",
      "display": "Çôℓôř T¥ƥè",
      "desc": "Tλè Çôℓôř T¥ƥè çôñƭřôℓ áℓℓôωƨ ƭλè úƨèř ƭô ƨèƭ λôω ƭλè çôℓôř ôƒ ƭλè ôúƭƥúƭ ƨλôúℓδ βè δèƭèř₥ïñèδ."
    }
  ]
}